<center><font size="4"><u>This is a jupyter notebook. Use <b>Shift + Enter</b> to run the current cell </u></font></center>

In [2]:
# First run each cell of this Jupyter Notebook and observe the output.
# You can change the code in each cell and see how the output changes.
# By hitting the "+" button, you can also insert an additional cell in between the two cells. 
# We are showing you an example with a very small file so that you can verify it with excel, but the real power
#of Pandas is that it can handle very large files with ease.

In [3]:
import pandas as pd                       # This line is used to import pandas library. 
                                          # Pandas is a long word to use, that's why use it "as pd"

In [30]:
dataframe = pd.read_csv("students.csv")   # Reading/Opening a csv(comma separated values) file (table like)
                                          # The csv file and this Jupyter notebook both must be in your Python working directory.

In [31]:
dataframe
#Table inside the csv file {Column -> Type : Credit/Audit}
#This will show you the whole file. But it's not wise to do this when the file is large.

      Name Gender  Marks Type
0    Shyam      M     76    C
1    Mohan      M     74    A
2   Ramesh      F     47    C
3  Stanzin      F     89    C
4   Rajesh      M     55    C
5   Parker      M     45    A
6   Mukesh      F     34    C
7    Soham      M     78    A
8    Milan      F     91    A

In [32]:
print (dataframe.head())
# Prints out the first 5 data rows, 
#This is useful when the file is large. This command only reads top 5 rows in a file.
#Thus this operation doesn't consume much resources and time.

      Name Gender  Marks Type
0    Shyam      M     76    C
1    Mohan      M     74    A
2   Ramesh      F     47    C
3  Stanzin      F     89    C
4   Rajesh      M     55    C

In [33]:
df = dataframe                               # Shorten the name
len(df)

9

In [34]:
df.head(n=7) #Shows first 7 entries of the dataframe

      Name Gender  Marks Type
0    Shyam      M     76    C
1    Mohan      M     74    A
2   Ramesh      F     47    C
3  Stanzin      F     89    C
4   Rajesh      M     55    C
5   Parker      M     45    A
6   Mukesh      F     34    C

In [35]:
df.tail(n=4) #Shows last 4 entries of the dataframe

     Name Gender  Marks Type
5  Parker      M     45    A
6  Mukesh      F     34    C
7   Soham      M     78    A
8   Milan      F     91    A

In [36]:
df.info() 
#Gives information about every column in the dataframe
# You can identify if there's any missing data. Currently there's no missing data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
Name      9 non-null object
Gender    9 non-null object
Marks     9 non-null int64
Type      9 non-null object
dtypes: int64(1), object(3)
memory usage: 368.0+ bytes

In [37]:
df.describe()
# Gives statistics of columns with numeric data types (int / float)

           Marks
count   9.000000
mean   65.444444
std    20.634383
min    34.000000
25%    47.000000
50%    74.000000
75%    78.000000
max    91.000000

In [38]:
df['Gender'].value_counts()
# value_counts() gives the number of unique entries for each item in the given column.

M    5
F    4
Name: Gender, dtype: int64

<center><font size="4"><u>To select a particular column</u></font></center>

In [39]:
mark_col = dataframe['Marks']               # Or use df.Marks....Try that!!!

In [40]:
mark_col                                    # Try type(mark_col)

0    76
1    74
2    47
3    89
4    55
5    45
6    34
7    78
8    91
Name: Marks, dtype: int64

In [41]:
mark_list = list (mark_col)                  # Make it python list

<center><font size="4">Subset Dataframe with desired columns</font></center>

In [42]:
df[['Name', 'Marks']]

      Name  Marks
0    Shyam     76
1    Mohan     74
2   Ramesh     47
3  Stanzin     89
4   Rajesh     55
5   Parker     45
6   Mukesh     34
7    Soham     78
8    Milan     91

<center><font size="4"><u>Filtering the dataframe</u></font></center>

In [43]:
# Step 1
df['Marks']>55                 # Conditioned statement: Return boolean

0     True
1     True
2    False
3     True
4    False
5    False
6    False
7     True
8     True
Name: Marks, dtype: bool

In [44]:
# Step 2
df[df['Marks']>55]             # Filtering the "True" data out of dataframe

      Name Gender  Marks Type
0    Shyam      M     76    C
1    Mohan      M     74    A
3  Stanzin      F     89    C
7    Soham      M     78    A
8    Milan      F     91    A

In [45]:
(df.Gender=='M') & (df.Marks>50)  # Applying 2 conditions

0     True
1     True
2    False
3    False
4     True
5    False
6    False
7     True
8    False
dtype: bool

In [46]:
df[(df.Gender=='M') & (df.Marks>50)]     # Filtered Male student with greater than 50 marks

     Name Gender  Marks Type
0   Shyam      M     76    C
1   Mohan      M     74    A
4  Rajesh      M     55    C
7   Soham      M     78    A

In [47]:
df                                       # What? no change!!!!

      Name Gender  Marks Type
0    Shyam      M     76    C
1    Mohan      M     74    A
2   Ramesh      F     47    C
3  Stanzin      F     89    C
4   Rajesh      M     55    C
5   Parker      M     45    A
6   Mukesh      F     34    C
7    Soham      M     78    A
8    Milan      F     91    A

In [48]:
df2 = df[(df.Gender=='M') & (df.Marks>50)]     # Need to assign the dataframe to a variable to retain it./

In [49]:
df2

     Name Gender  Marks Type
0   Shyam      M     76    C
1   Mohan      M     74    A
4  Rajesh      M     55    C
7   Soham      M     78    A

<center><font size="4"><u>Saving back to csv file</u></font></center>

In [50]:
df2.to_csv('filtered.csv')                     # Check your current working directory to find a new csv file.

<center><font size="4"><u>Selection : Just like 2-D array selection</u></font></center>

In [51]:
df.loc[4, 'Name']                              # Row = 4, Column = 'Name'

'Rajesh'

In [52]:
df.loc[[1,5,8], ['Name', 'Type']]              # Multiple Selection

     Name Type
1   Mohan    A
5  Parker    A
8   Milan    A

In [53]:
df3 = df.set_index('Name')

In [54]:
df3

        Gender  Marks Type
Name
Shyam        M     76    C
Mohan        M     74    A
Ramesh       F     47    C
Stanzin      F     89    C
Rajesh       M     55    C
Parker       M     45    A
Mukesh       F     34    C
Soham        M     78    A
Milan        F     91    A

In [55]:
df3.loc[['Shyam', 'Mohan'], ['Marks', 'Type']]

       Marks Type
Name
Shyam     76    C
Mohan     74    A

<font size="4"> To create a dataframe of your own, follow this simple<a ref="https://www.geeksforgeeks.org/different-ways-to-create-pandas-dataframe/"> link</a> 
</font></center><br>
<font size="4">Official Pandas documentation and <b>Stack overflow</b> will surely help you for the rest </font></center>